branches/smartstep_under_construction/src_test/extensions-testbed/results/smartSTEP(20100717)/throw-soapfaultexception-sin/soap-trace-client.log

Tracing Web Service client: {urn:hello:wsdl}HelloService
Outbound SOAP message:
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <sayHello xmlns="urn:hello:wsdl">
      <name>friend</name>
    </sayHello>
  </S:Body>
</S:Envelope>
Tracing Web Service client: {urn:hello:wsdl}HelloService
Outbound SOAP message:
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <sayHello xmlns="urn:hello:wsdl">
      <name>friend</name>
    </sayHello>
  </S:Body>
</S:Envelope>
Tracing Web Service client: {urn:hello:wsdl}HelloService
Inbound SOAP message containing a Fault:
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Header/>
  <S:Body>
    <S:Fault>
      <faultcode xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">SOAP-ENV:Server</faultcode>
      <faultstring>ErrorsWebServiceInterceptor generated exception in method interceptMessage-server-inbound</faultstring>
    </S:Fault>
  </S:Body>
</S:Envelope>
Tracing Web Service client: {urn:hello:wsdl}HelloService
Inbound SOAP message containing a Fault:
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Header/>
  <S:Body>
    <S:Fault>
      <faultcode xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">SOAP-ENV:Server</faultcode>
      <faultstring>ErrorsWebServiceInterceptor generated exception in method interceptMessage-server-inbound</faultstring>
    </S:Fault>
  </S:Body>
</S:Envelope>
